---
layout: post
title: 字节跳动+腾讯实习面经
category: blog
tags: [hadoop]
description: 大数据研发相关。
---


## 腾讯ieg一面（30分钟）：

实习经历、业务
sparkstreaming
sparkstreaming和StructedStreaming
spark hadoop区别
spark为什么快
多线程多进程
什么时候提交job
spark处理流程
spark和flink流处理区别
flinK流处理过程
那个性能更好为什么，大约好到什么程度

## 腾讯ieg二面（60分钟）

这一面是有点压力的。。。好多问题硬着头皮回答，记不清了
关于爱奇艺的实习内容
redis场景，为什么单线程性能好
多线程是否会更好
为什么单线程
io多路复用原理
redis的Qps
两道场景题+知识点很难描述
DAG划分spark源码实现
spark join过程
spark的Broadcast
快排
海量数据问题(用堆的topk）

面试官很nice场景题讨论比较久，我也不知道说的对不对，毕竟实际的场景我也没用过...还好我会蒙哈

## 腾讯ieg三面（30分钟）

二面之后面试官就明确告诉我通过，我就知道稳了，说面试官比较忙，让我耐心等待三面，随时联系他...于是我就在入职头条半个月后收到了三面...然而头条是二面之后才面的，不到一周就顺利入职...这里不得不吐槽一下腾讯的效率真的是...一言难尽哈

这一面都在聊天，然后面试官跟我说岗位是深圳的，我说我已经入职宇宙条了。。。不想去深圳，还要在上海读书，不能去太远吧，就这样也算委婉的拒绝了吧...毕业我还想去腾讯广点通，感觉不要太尴尬，于是，后面面试官就给我转组到了上海......

## 腾讯ieg四面（60分钟）

这一面也是很突然，和三面一个部门，给我转组到了上海...我还能说什么呢，上班时间偷偷去电话间就开始了，面试官说明来意后就开始了

整形范围
排序算法
堆排序过程
KAFKA有序性
如何保证KAFKA有序
spark源码讲解
一道业务场景题
剩下记不清了，过太久了...

面完感觉也还可以，感觉大概通过了

## 腾讯ieg五面（30分钟）

没什么技术问题，他说他看到面评还不错，之前已经面的够多了。。。剩下的时间都在和我聊头条的事，貌似对头条很熟的亚子，问我是不是在DATA之类的，整个面试我觉得是非常尴尬的，总是问我有什么在头条不满意的地方，但是到目前为止我都很满意。。。唉，最后面完了，告诉后面还有一位上海和深圳的老大会面...

## 六面（10分钟HR）

最后没有老大面，我想三面那个应该是总的老大了，在HR之前加了一面的微信，已经明确告诉我通过了，然后就和HR尬聊了10分钟



## 字节跳动一面（60分钟）：

hadoop的MR过程
spark的shuffle过程
hadoop和spark的区别

记不清了。。。

三道算法：

实现sqrt功能函数
链表反转
最大堆
+一道sql

## 字节跳动二面（60分钟）

操作系统内存寻址
海量日志信息提取
时间复杂度定义


两道算法：
不重复字串最大长度
二叉树层序遍历

常规题答得自我感觉不好也给过了，第二天约了三面，可能因为代码写得比较快吧。算法条名不虚传哈

## 字节跳动三面（60分钟）

这一面压力好大，面试官太严肃了，心里压力很大。
问题还是蛮难的
不过依然已经记不清了
手写spark算子，我写了30几个才叫停....
map和flatmap区别
groupbykey和reducebykey区别
数据倾斜问题

两道算法：
一道scala代码
大数问题算法


然后就面完了，总体感觉还行，至少算法都手撸出来了，感觉应该不会挂，然后后面就收到了hr电话。


## 字节跳动四面（HR10分钟）

依然是聊天。

最后就都拿到offer啦。腾讯迟来的offer然我感到很是头疼，头条的工作体验很好，但是腾讯我也很喜欢......




